Product/Production/Examples/WSDLClientFileIssue_OldESB/SampleService1EJB/src/conf/wsdl/SampleService/SampleService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="SampleService" targetNamespace="urn:gov:hhs:fha:nhinc:wsdlissue:wsdl:sample"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:gov:hhs:fha:nhinc:wsdlissue:wsdl:sample" xmlns:ns="urn:gov:hhs:fha:nhinc:wsdlissue:schema:sample" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="urn:gov:hhs:fha:nhinc:wsdlissue:wsdl:sample">
            <xsd:import namespace="urn:gov:hhs:fha:nhinc:wsdlissue:schema:sample" schemaLocation="../schemas/sample/SampleSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="SampleOperationRequest">
        <part name="part1" element="ns:SampleOperationInput"/>
    </message>
    <message name="SampleOperationResponse">
        <part name="part1" element="ns:SampleOperationOutput"/>
    </message>
    <portType name="SampleServicePortType">
        <operation name="SampleOperation">
            <input name="input1" message="tns:SampleOperationRequest"/>
            <output name="output1" message="tns:SampleOperationResponse"/>
        </operation>
    </portType>
    <binding name="SampleServiceBinding" type="tns:SampleServicePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="SampleOperation">
            <soap:operation soapAction="SampleOperation"/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="SampleServiceService">
        <port name="SampleServicePort" binding="tns:SampleServiceBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/SampleServiceService/SampleServicePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="SampleService">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SampleServicePortTypeRole" portType="tns:SampleServicePortType"/>
    </plnk:partnerLinkType>
</definitions>
