Product/Production/Examples/WSDLClientFileIssue_OldESB/SampleService3CA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:wsdlissue:schema:sample">
  <soapenv:Body>
    <urn:SampleOperationInput>
      <urn:inputParam>?string?</urn:inputParam>
    </urn:SampleOperationInput>
  </soapenv:Body>
</soapenv:Envelope>